---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner.Straight
enum: Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner
source: html/7a0d0391-3f99-9c82-9e1a-7be5672f66c2.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathLineShapeAtCorner.Straight

The line shape of stairs path at the corner is straight.